src/InformationRegisters/ДатыВозвратаДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ДатыВозвратаДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПечатногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПечатныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ДатыВозвратаДокументов/Ext/ManagerModule.bsl
Процедура Добавить(Документ, ВидПечатногоДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыВозвратаДокументов.Документ
		|ИЗ
		|	РегистрСведений.ДатыВозвратаДокументов КАК ДатыВозвратаДокументов
		|ГДЕ
		|	ДатыВозвратаДокументов.Документ = &Документ
		|	И ДатыВозвратаДокументов.ВидПечатногоДокумента = &ВидПечатногоДокумента";
	
	Запрос.УстановитьПараметр("ВидПечатногоДокумента", ВидПечатногоДокумента);
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	МЗ = РегистрыСведений.ДатыВозвратаДокументов.СоздатьМенеджерЗаписи();
	МЗ.Документ 				= Документ;
	МЗ.ВидПечатногоДокумента 	= ВидПечатногоДокумента;
	МЗ.ДатаВозврата 			= ТекущаяДата();
	МЗ.Пользователь 			= ПараметрыСеанса.ТекущийПользователь;
	МЗ.Записать();
	
КонецПроцедуры

Функция ДанныеДокумента(Документ, ВидПечатногоДокумента) Экспорт
	
	СтрокаПолей = ПоляРегистраСтрокой();
	ДанныеДокумента = Новый Структура(СтрокаПолей);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	"+СтрокаПолей+"
	|ИЗ
	|	РегистрСведений.ДатыВозвратаДокументов КАК ДатыПечатиДокументов
	|ГДЕ
	|	ДатыПечатиДокументов.Документ = &Документ
	|	И ДатыПечатиДокументов.ВидПечатногоДокумента = &ВидПечатногоДокумента";
	
	Запрос.УстановитьПараметр("ВидПечатногоДокумента", 	ВидПечатногоДокумента);
	Запрос.УстановитьПараметр("Документ", 				Документ);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ДанныеДокумента, Выборка);
	КонецЕсли;
	
	Возврат ДанныеДокумента;
	
КонецФункции

Функция ПоляРегистраСтрокой()
	
	Возврат "Документ, ВидПечатногоДокумента, ДатаВозврата, Пользователь";
	
КонецФункции
